app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-04-26 04:38:57.026579"], ["updated_at", "2019-04-26 04:38:57.026579"]]
---
  def create
    @school_class = SchoolClass.new(student_class_params(:title, :room_number))
    @school_class.save